// Observed incorrect readings, matched only against their original word context.
export const HIRAGANA_REJECTED_READINGS: Record<string,string[]> = {
  "くじ引き": [
    "くじひき"
  ],
  "問わ": [
    "もんわ"
  ],
  "問い": [
    "もんい"
  ],
  "問う": [
    "もんう"
  ],
  "問いかける": [
    "もんいかける"
  ],
  "問いかけれ": [
    "もんいかけれ"
  ],
  "分かる": [
    "ふんかる"
  ],
  "分から": [
    "ふんから"
  ],
  "分かっ": [
    "ふんかっ"
  ],
  "分かり": [
    "ふんかり"
  ],
  "分かん": [
    "ふんかん"
  ],
  "分かれ": [
    "ふんかれ"
  ],
  "分かれる": [
    "ふんかれる"
  ],
  "分かち": [
    "ふんかち"
  ],
  "分ける": [
    "ふんける"
  ],
  "分け": [
    "ふんけ"
  ],
  "分けよ": [
    "ふんけよ"
  ],
  "分け与え": [
    "ふんけあたえて"
  ],
  "分け与える": [
    "ふんけあたえる"
  ],
  "引き分け": [
    "ひきふんけ"
  ],
  "おすそ分け": [
    "おすそふんけ"
  ],
  "上げる": [
    "うえげる"
  ],
  "上げ": [
    "うえげ"
  ],
  "上げよ": [
    "うえげよ"
  ],
  "上がり": [
    "うえがり"
  ],
  "上がる": [
    "うえがる"
  ],
  "上がっ": [
    "うえがっ"
  ],
  "上る": [
    "うえる"
  ],
  "上り": [
    "うえり"
  ],
  "上っ": [
    "うえっ"
  ],
  "上書き": [
    "うえかき"
  ],
  "上回る": [
    "うえかいる"
  ],
  "上回れ": [
    "うえかいれ"
  ],
  "引き上げ": [
    "ひきうえげ"
  ],
  "すくい上げ": [
    "すくいうえげ"
  ],
  "くり上げる": [
    "くりうえげる"
  ],
  "数える": [
    "かずえる"
  ],
  "数え": [
    "かずえ"
  ],
  "分数": [
    "ふんかず"
  ],
  "回数": [
    "かいかず"
  ],
  "点数": [
    "てんかず"
  ],
  "人数": [
    "にんかず"
  ],
  "個数": [
    "こかず"
  ],
  "倍数": [
    "ばいかず"
  ],
  "手数": [
    "てかず"
  ],
  "度数": [
    "たびにかず"
  ],
  "全数": [
    "ぜんぶかず"
  ],
  "年数": [
    "ねんかず"
  ],
  "けた数": [
    "けたかず"
  ],
  "回る": [
    "かいる"
  ],
  "回り": [
    "かいり"
  ],
  "回っ": [
    "かいっ"
  ],
  "回ろ": [
    "かいろ"
  ],
  "回分": [
    "かいふん"
  ],
  "今回": [
    "いまかい"
  ],
  "今度": [
    "いまたびに"
  ],
  "次回": [
    "つぎかい"
  ],
  "時点": [
    "ときてん"
  ],
  "次点": [
    "つぎてん"
  ],
  "次第": [
    "つぎだい"
  ],
  "個人": [
    "こにん"
  ],
  "声質": [
    "こえしつ"
  ],
  "語る": [
    "ことばる"
  ],
  "語り": [
    "ことばり"
  ],
  "語っ": [
    "ことばっ"
  ],
  "語ら": [
    "ことばら"
  ],
  "語ろ": [
    "ことばろ"
  ],
  "フランス語": [
    "フランスことば"
  ],
  "全く": [
    "ぜんぶく"
  ],
  "恥ずかし": [
    "はじずかし"
  ],
  "恥ずかしく": [
    "はじずかしく"
  ],
  "八ツ橋": [
    "はちツきょう"
  ],
  "影印": [
    "かげいん"
  ],
  "どんでん返し": [
    "どんでんかえし"
  ],
  "木の葉": [
    "きのは"
  ],
  "加え": [
    "くわえて"
  ],
  "加えよ": [
    "くわえてよ"
  ],
  "加えれ": [
    "くわえてれ"
  ],
  "捨て": [
    "すてて"
  ],
  "捨てろ": [
    "すててろ"
  ],
  "与え": [
    "あたえて"
  ],
  "長押し": [
    "ちょうおし",
    "なげしし"
  ]
};
